{
    "intermediate":{
            "MPC":{
                    "about":"MPC stands for Mathematics, Physics, and Chemistry, and is a group of subjects offered in the 10+2 Intermediate program in India. It is also known as the PCM Group. MPC is available in several states, including Andhra Pradesh, Telangana, Kerala, Karnataka, and Tamil Nadu. In some states, the equivalent of MPC is MEC (Mathematics, Economics, and Chemistry) or MECS (Mathematics, Economics, Chemistry, and Statistics).",
                    "competitive exams":{
                            "Engineering Entrance Exams:": [
                                "JEE Main and JEE Advanced: The primary exams for admission to B.Tech courses at IITs, NITs, and other engineering colleges.",
                                "BITSAT: Entrance exam for B.Tech courses at BITS Pilani and its campuses.",
                                "VITEEE: Entrance exam for VIT University for B.Tech courses.",
                                "SRMJEEE: Entrance exam for admission to SRM University.",
                                "WBJEE: West Bengal Joint Entrance Exam for engineering colleges in West Bengal.",
                                "MHT CET: Maharashtra Common Entrance Test for engineering colleges in Maharashtra.",
                                "COMEDK: Consortium of Medical, Engineering and Dental Colleges of Karnataka exam for engineering seats in Karnataka."
                            ],
                            "Architecture Entrance Exams:": [
                                "NATA: The National Aptitude Test in Architecture is for admission to B.Arch. programs across India.",
                                "JEE Main Paper 2: This is another option for those interested in B.Arch. at institutions like NITs and IITs."
                            ],
                            "Defense Services:": [
                                "NDA (National Defence Academy): With MPC, you can appear for the NDA exam to join the Army, Navy, or Air Force.",
                                "Technical Entry Scheme (TES): An option for joining the Indian Army directly after 10+2 MPC."
                            ],
                            "Merchant Navy Exams:": [
                                "IMU CET: Indian Maritime University Common Entrance Test for courses related to marine engineering, nautical sciences, and the merchant navy.",
                                "TMI SAT: Tolani Maritime Institute's entrance exam for marine engineering."
                            ],
                            "Science and Research Institutes:": [
                                "ISI Admission Test: For admission to the Indian Statistical Institute, which offers programs in statistics, mathematics, and related fields.",
                                "IISER Aptitude Test: For admission to the Indian Institutes of Science Education and Research for a BS-MS program.",
                                "KVPY: Kishore Vaigyanik Protsahan Yojana, a fellowship program to encourage students interested in research careers in basic sciences."
                            ],
                            "Other State-Level Engineering Exams:": [
                                "Various states conduct their own entrance exams for admission to engineering colleges within their regions, such as AP EAMCET (Andhra Pradesh), TS EAMCET (Telangana), and KCET (Karnataka)."
                            ],
                            "Central Universities Entrance Tests:": [
                                "CUET (Common University Entrance Test): Some central universities conduct entrance exams for undergraduate courses, including science and technology programs."
                            ]
                    },
                    "jobs can be done after compelting of inter mpc":{
                            "Engineering:": [
                                "B.Tech/B.E.: Pursue engineering in various fields like Computer Science, Mechanical, Civil, Electrical, Electronics, Chemical, etc., by appearing for exams like JEE Main, JEE Advanced, or state-level exams.",
                                "Diploma Courses in Engineering: Short-term diploma courses can be a good option if you’re looking to start working sooner."
                            ],
                            "Architecture:": [
                                "B.Arch (Bachelor of Architecture): Requires an entrance exam (like NATA or JEE Main Paper 2). It’s a five-year course to become an architect."
                            ],
                            "Pure Sciences:": [
                                "B.Sc. in Physics, Chemistry, or Mathematics: This can lead to careers in research, teaching, and applied science roles.",
                                "Integrated M.Sc.: Some universities offer integrated M.Sc. programs after 10+2 that include both undergraduate and postgraduate studies."
                            ],
                            "Computer Science and IT Courses:": [
                                "BCA (Bachelor of Computer Applications): This degree is great for pursuing a career in IT, software development, or data science.",
                                "Diploma in Computer Science/Information Technology: These diplomas can provide hands-on technical skills in a shorter timeframe."
                            ],
                            "Commercial Pilot Training:": [
                                "Pilot Training Programs: After MPC, you can train to become a commercial pilot. This requires both physical and written assessments, along with significant training."
                            ],
                            "Merchant Navy:": [
                                "Marine Engineering/Nautical Science: Courses in marine engineering or nautical science can open up careers in the merchant navy, with positions like navigation officer, marine engineer, etc."
                            ],
                            "Bachelors in Planning or Environmental Studies:": [
                                "B.Planning (Bachelor in Planning): Suitable for those interested in urban and regional planning.",
                                "Environmental Science: Relevant if you’re interested in working in conservation, environmental management, or sustainability."
                            ],
                            "Pharmacy:": [
                                "B.Pharm (Bachelor of Pharmacy): This leads to careers in the pharmaceutical industry, hospitals, and labs."
                            ],
                            "Other Specialized Courses and Vocational Training:": [
                                "Data Science and Analytics: Short courses or diplomas in data science, machine learning, or analytics can prepare you for a career in this rapidly growing field.",
                                "Animation, Gaming, and Multimedia: This creative field is open to MPC students and can lead to roles in animation studios, game development companies, and multimedia firms.",
                                "Fire and Safety Courses: These are vocational courses that provide job opportunities in safety management."
                            ],
                            "Government Jobs:": [
                                "Clerical and Assistant Roles: Positions in railways, banking (through exams like IBPS Clerk), and public sector clerical roles are open to 10+2 graduates.",
                                "SSC CHSL Exam: Offers entry-level government jobs such as data entry operator and lower division clerk."
                            ]
                    }
            },
            "BIPC":{
                "about":"BiPC (Biology, Physics, and Chemistry) is a popular stream in India for students interested in biology, life sciences, and healthcare. It is a common choice for students aiming for careers in medicine, paramedical fields, or life sciences",
                    "Career Options and Courses after BiPC:": [
                        "Medical: Careers as doctors, dentists, or veterinary doctors through courses like MBBS, BDS, and BVSc.",
                        "Paramedical and Allied Health: Fields like physiotherapy, medical lab technology, radiology, and nursing.",
                        "Life Sciences: Research-oriented careers through courses in biotechnology, microbiology, genetics, botany, and zoology.",
                        "Agricultural Sciences: Degrees in agriculture, horticulture, and forestry.",
                        "Environmental and Biological Sciences: Careers in environmental science, conservation, and ecology."
                    ],
                    "Popular Courses after BiPC:": [
                        "MBBS (Bachelor of Medicine and Bachelor of Surgery): For becoming a doctor.",
                        "BDS (Bachelor of Dental Surgery): For a career in dentistry.",
                        "BAMS (Bachelor of Ayurvedic Medicine and Surgery): Ayurveda-focused course.",
                        "BHMS (Bachelor of Homeopathic Medicine and Surgery): Homeopathic medicine.",
                        "BVSc (Bachelor of Veterinary Science): Veterinary practice.",
                        "B.Pharm (Bachelor of Pharmacy): For careers in the pharmaceutical sector.",
                        "B.Sc. Nursing: For a career in nursing.",
                        "B.Sc. in Allied Health Sciences: Options include fields like medical lab technology, radiology, and anesthesia.",
                        "BPT (Bachelor of Physiotherapy): Physiotherapy.",
                        "B.Sc. Life Sciences: Specializations include biotechnology, microbiology, botany, and zoology.",
                        "B.Sc. Agriculture: For careers in agriculture, farming science, and agribusiness.",
                        "B.Sc. Environmental Science: For those interested in ecology and environmental management."
                    ],
                    "Competitive Exams for BiPC Students:": [
                        "NEET (National Eligibility cum Entrance Test): The primary exam for medical and dental courses like MBBS, BDS, BAMS, BHMS, and BVSc in India.",
                        "ICAR AIEEA (Indian Council of Agricultural Research All India Entrance Examination): For admission to agriculture, horticulture, and other agricultural science courses.",
                        "AIIMS Nursing: For admission into the Bachelor of Nursing at AIIMS institutions.",
                        "JIPMER: Entrance exam for MBBS at JIPMER (Puducherry).",
                        "EAMCET (Engineering, Agriculture, and Medical Common Entrance Test): State-level exams (like TS EAMCET or AP EAMCET) for courses like B.Pharm, B.Sc. Agriculture, and veterinary sciences.",
                        "AFMC: For joining the Armed Forces Medical College, Pune."
                    ],
                    "Alternative Careers and Vocational Courses:": [
                        "Diploma in Medical Lab Technology (DMLT): Training to work as a lab technician.",
                        "Diploma in X-Ray Technology: Radiology assistant positions in hospitals.",
                        "Diploma in Dental Hygienist or Dental Mechanic: Supporting roles in dental clinics.",
                        "Public Health Administration: For roles in health policy and management.",
                        "Diploma in Food Technology: Work in food safety, quality control, or production."
                    ],
                    "Government Job Options after BiPC:": [
                        "Staff Selection Commission (SSC): Exams like SSC CHSL or SSC CGL offer roles in various government departments.",
                        "Railway Recruitment Board (RRB): Non-technical and technical positions in the Indian Railways.",
                        "State Health Departments: Positions such as lab technicians, health assistants, and pharmacists.",
                        "Public Sector Units (PSUs): Healthcare roles in PSUs like government hospitals and clinics."
                    ]
            },
            "HEC":{
                "about":"HEC (History, Economics, and Civics) is a popular combination in the Humanities or Arts stream for students in India. This combination is ideal for those interested in social sciences, governance, law, economics, and public administration. Let’s explore what HEC entails, potential career paths, and further education options available to students who choose this stream after 10+2.",
                    "Further Studies after HEC:": [
                        "B.A. (Bachelor of Arts): The most common course after HEC, with specializations in History, Economics, Political Science, Sociology, and Public Administration.",
                        "B.A. Economics: A specialized degree for those particularly interested in economics, leading to roles in finance, business analysis, and policy-making.",
                        "B.A. Political Science: Focused on political theory, public policy, and governance, ideal for students interested in politics, international relations, and diplomacy.",
                        "B.A. History: Suitable for those with an interest in historical research, archaeology, heritage conservation, and teaching.",
                        "B.A. Public Administration: Ideal for those interested in careers in government administration, policy-making, and management.",
                        "BBA (Bachelor of Business Administration): A good choice for students interested in business and management, particularly if they want to combine economic knowledge with managerial skills.",
                        "B.Com (Bachelor of Commerce): For those interested in accounting, finance, and business, as Economics provides a strong foundation for these fields.",
                        "Bachelor of Law (LLB): HEC students are well-suited for a law career. After completing an LLB, you can pursue specializations in civil, criminal, or corporate law.",
                        "Journalism and Mass Communication: For careers in media, reporting, and communication.",
                        "Bachelors in Social Work (BSW): For those passionate about working in social welfare, NGOs, or community development.",
                        "B.Ed. (Bachelor of Education): For a teaching career in schools, specializing in social sciences."
                    ],
                    "Competitive Exams and Government Jobs for HEC Students:": [
                        "UPSC Civil Services Exam: A popular choice among HEC students, especially for those aspiring to join the Indian Administrative Services (IAS), Indian Foreign Services (IFS), or Indian Police Services (IPS).",
                        "SSC Exams: Various exams conducted by the Staff Selection Commission for government jobs in departments and ministries.",
                        "State Public Service Commissions (PSC): Exams conducted by state governments to recruit for administrative and other state-level roles.",
                        "Banking Exams: Exams like IBPS PO, SBI PO, and RBI Assistant are open to HEC students, with their economics background often proving helpful.",
                        "RRB NTPC (Railway Recruitment Board Non-Technical Popular Categories): For clerical, accounts, and assistant positions in Indian Railways.",
                        "LIC AAO (Life Insurance Corporation Assistant Administrative Officer): An administrative role in the insurance sector."
                    ],
                    "Career Options after HEC:": [
                        "Civil Services: A popular choice for HEC students who wish to work in administration, governance, and public service.",
                        "Law and Judiciary: With a foundation in civics, HEC students can pursue a law degree and go on to practice law, work as legal advisors, or join the judiciary.",
                        "Economist or Financial Analyst: After specializing in Economics, you can work in finance, banking, and policy research.",
                        "Journalism and Mass Communication: HEC students can work as reporters, editors, or news analysts, with a focus on politics, economics, or history.",
                        "Teaching and Academia: With further qualifications like a B.Ed. or M.A., HEC students can teach in schools and universities.",
                        "Social Work and NGOs: Working in NGOs, public welfare organizations, and policy advocacy.",
                        "Research and Archaeology: After specializing in history, you can work in historical research, archaeology, museum curation, or heritage management."
                    ],
                    "Professional Courses and Certifications:": [
                        "Diploma in Public Relations: For careers in corporate communication and media relations.",
                        "Digital Marketing: To work in content creation, social media management, and online advertising.",
                        "Event Management: A popular choice for those interested in organizing public events, festivals, and corporate functions.",
                        "Data Analysis: Courses in data analysis and statistics can be useful, especially for students with an Economics background."
                    ],
                    "Advantages of Choosing HEC:": [
                        "Versatile Career Options: HEC offers the flexibility to enter a wide range of fields, from law and administration to teaching and journalism.",
                        "Strong Foundation for Civil Services: HEC subjects align well with the syllabus of civil services exams like UPSC, giving students a head start.",
                        "Broad Knowledge Base: A background in history, economics, and civics provides insights into current affairs, society, and governance.",
                        "Opportunities in Social Impact and Policy-making: HEC students often have a strong understanding of societal issues, making them well-suited for roles in policy advocacy and social work."
                    ]
            },
            "MEC":{
                "about":"MEC (Mechanical Engineering) in intermediate (commonly referred to as inter in India) is a popular stream for students who aspire to pursue a career in engineering. It focuses on subjects like physics, mathematics, and mechanical principles. Students learn about thermodynamics, fluid mechanics, machine design, and material science. The course prepares students for higher studies in mechanical engineering and related fields. It is considered a challenging yet rewarding path for those interested in machinery and problem-solving.",
                    "Commerce and Business-related Exams:": [
                        "CA (Chartered Accountancy): A professional course for those interested in becoming chartered accountants. The exam is conducted by the Institute of Chartered Accountants of India (ICAI) and consists of three levels: CPT (Common Proficiency Test), IPCC (Integrated Professional Competence Course), and CA Final.",
                        "CS (Company Secretary): Conducted by the Institute of Company Secretaries of India (ICSI), this course leads to becoming a Company Secretary, responsible for legal and governance functions in companies.",
                        "CMA (Cost Management Accounting): A course offered by the Institute of Cost Accountants of India, leading to certification as a Cost Accountant, who specializes in cost management and financial management.",
                        "CFA (Chartered Financial Analyst): A global certification for finance professionals, focusing on investment analysis, portfolio management, and financial planning."
                    ],
                    "Management and Business Administration Exams:": [
                        "IPMAT: Integrated Programme in Management Aptitude Test is an entrance exam for admission to the 5-year Integrated Management Program at IIM Indore and IIM Rohtak.",
                        "CAT: Common Admission Test for admission to top MBA colleges in India, including IIMs (Indian Institutes of Management). Although this exam is typically taken after graduation, some students pursue MBA after completing MEC with a focus on management.",
                        "MAT: Management Aptitude Test is another common exam for MBA admissions in various institutes across India.",
                        "XAT: Xavier Aptitude Test for admission to MBA programs in Xavier's institutes and other associated business schools.",
                        "NMAT: NMIMS Management Aptitude Test, for admission to Narsee Monjee Institute of Management Studies (NMIMS)."
                    ],
                    "Economics and Research Career Exams:": [
                        "UPSC Civil Services Exam: If you are interested in a career in public administration, economics, or policymaking, you can appear for the Union Public Service Commission (UPSC) Civil Services Exam. Economics graduates often opt for the Indian Economic Service (IES) exam, which is part of the UPSC exams.",
                        "IIT JAM (Joint Admission Test for M.Sc.): For students who wish to pursue an M.Sc. in economics or related fields at IITs and IISc.",
                        "NTA UGC NET: For those who wish to pursue a career in teaching economics or commerce at the college/university level, the National Eligibility Test (NET) is required.",
                        "Indian Economic Service (IES): Conducted by UPSC for those who want to become economic officers in various government departments and ministries."
                    ],
                    "Other Career Options:": [
                        "B.Com (Bachelor of Commerce): After completing MEC, you can pursue a B.Com degree in various specializations like general commerce, accounts, or business management. Several competitive exams, like B.Com Entrance Exams conducted by various universities, are an option.",
                        "BBA/BBM (Bachelor of Business Administration/Management): A popular choice for students interested in business and management. After completing a BBA/BBM, students can take exams like CAT for MBA admissions.",
                        "BBA LLB: A 5-year integrated program for students who are interested in pursuing both law and business. You can enter this field through exams like CLAT (Common Law Admission Test).",
                        "Banking Exams: If you're interested in banking, you can appear for exams like IBPS PO, SBI PO, or RBI Grade B for various banking roles."
                    ],
                    "Other Entrance Exams:": [
                        "Hotel Management: Exams like NCHM JEE (National Council for Hotel Management Joint Entrance Examination) for admissions to hotel management programs.",
                        "BCA (Bachelor of Computer Applications): If you are inclined towards technology, you can pursue BCA and appear for the relevant entrance exams for this course.",
                        "Law Exams (CLAT, AILET): For students interested in law, they can prepare for CLAT (Common Law Admission Test) or AILET (All India Law Entrance Test) for admission to top law schools."
                    ],
                    "State-level Exams:": [
                        "Various states in India conduct their own entrance exams for admissions to undergraduate courses in commerce, economics, and management, including TS EAMCET (Telangana), AP EAMCET (Andhra Pradesh), and Maharashtra CET (Common Entrance Test)."
                    ],
                    "Career Opportunities after MEC:": [
                        "Accountant: Both in the private and public sector, such as tax accounting, audit, etc.",
                        "Financial Analyst: Working in banks, insurance companies, investment firms, and financial consulting companies.",
                        "Economist: Research and analysis in government, policy-making, or financial institutions.",
                        "Entrepreneur: Starting your own business or joining family businesses.",
                        "Marketing/Sales Manager: In various sectors, from FMCG to tech companies.",
                        "Insurance and Risk Management: In sectors like banking and insurance, focusing on financial products, risk management, etc."
                    ]
            },
            "CEC":{
                "about":"CEC stands for Civics, Economics, and Commerce, a popular subject combination in the Arts and Humanities stream for students in India. This combination is ideal for those who are interested in understanding the socio-economic fabric of society, governance, financial systems, and business management.",
                "Further Studies After CEC:": [
                    "B.Com (Bachelor of Commerce): A fundamental course for students interested in accounting, finance, auditing, taxation, and other commerce-related fields.",
                    "BBA/BMS (Bachelor of Business Administration/Bachelor of Management Studies): For students aiming for a career in business management and leadership roles in corporate sectors.",
                    "BA Economics: For students who want to specialize in economics and pursue careers as economists, financial analysts, or policy researchers.",
                    "BA Political Science: If you are interested in governance, public administration, or international relations, this degree is suitable for you.",
                    "BCA (Bachelor of Computer Applications): For students interested in computer science and information technology but who prefer a combination of social sciences like economics and commerce.",
                    "BBA LLB (Bachelor of Business Administration and Bachelor of Law): This integrated course combines business administration with law and prepares students for careers in corporate law or business law.",
                    "Bachelor of Hotel Management: For those interested in working in the hospitality and tourism industry.",
                    "CA (Chartered Accountancy): One of the most popular career paths for students who are interested in accounting and finance.",
                    "CS (Company Secretary): A professional course for those interested in company law, business regulations, and corporate governance.",
                    "CFA (Chartered Financial Analyst): A globally recognized credential for those interested in careers in finance and investment banking.",
                    "ICWA (Institute of Cost and Works Accountants): A professional certification focusing on cost management and corporate finance.",
                    "MBA (Master of Business Administration): After completing an undergraduate degree in Commerce or Economics, students can pursue an MBA to specialize in areas like marketing, finance, human resources, and international business."
                ],
                "Competitive Exams and Career Options After CEC:": [
                    "Civil Services Exam (UPSC): CEC students can appear for the UPSC exams to join the Indian Administrative Service (IAS), Indian Police Service (IPS), Indian Foreign Service (IFS), and other administrative roles.",
                    "Banking Exams: CEC students are eligible for various banking exams such as IBPS PO, SBI PO, RBI Assistant, etc., for roles like probationary officers, clerks, and assistants.",
                    "SSC Exams: The Staff Selection Commission (SSC) exams offer various government jobs in departments like income tax, customs, and central excise.",
                    "Indian Economic Service (IES): This is for students specializing in Economics who wish to join government services in roles related to economics and finance.",
                    "NDA (National Defence Academy): CEC students who are interested in joining the armed forces (Indian Army, Navy, or Air Force) can appear for the NDA exam.",
                    "CA, CS, and ICWA: Professional exams for students interested in accounting, finance, and business law."
                ],
                "Career Options after CEC:": [
                    "Banking and Finance: Careers in accounting, banking, investment analysis, and financial management.",
                    "Business Management: After pursuing a BBA or MBA, students can enter management positions, marketing, sales, human resources, and operations management.",
                    "Government Services: With a background in civics and economics, CEC students can opt for roles in public administration, foreign services, policy-making, and government sectors.",
                    "Law: A career in law through LLB after graduation is an attractive option for those interested in the legal field.",
                    "Economics and Research: Students with a specialization in economics can pursue roles as economists, financial analysts, market researchers, or policy advisors.",
                    "Corporate Sector: Careers in finance, marketing, business development, and operations in multinational companies or local businesses.",
                    "Entrepreneurship: Students with a flair for business can start their own ventures in fields like retail, finance, consulting, or service industries."
                ],
                "Advantages of Choosing CEC:": [
                    "Wide Range of Career Options: The combination of commerce, economics, and political science opens up a variety of fields including finance, law, business management, public administration, and economics.",
                    "Solid Foundation for Business and Finance Careers: Students gain insights into how businesses operate, understand the importance of economics, and learn about governance, all of which are valuable in business and finance roles.",
                    "Good for Government Jobs: Many competitive exams in India, like UPSC, SSC, and state exams, align well with the subjects studied in CEC.",
                    "Global Opportunities: With a background in commerce and economics, students can pursue global certifications like CFA, or apply for international jobs in business, finance, and management."
                ],
                "Skills Developed in CEC:": [
                    "Analytical Skills: Understanding economic theories and political systems helps develop strong analytical thinking.",
                    "Problem-Solving Skills: Economics and civics help students approach complex issues and find solutions from various perspectives.",
                    "Communication Skills: Civics and economics involve discussions on governance and social issues, enhancing verbal and written communication.",
                    "Financial Literacy: Commerce and economics impart key financial skills, useful in both personal and professional settings."
                ]

            },
            "HPC":{
                "about":"In the context of Indian education, HPC typically refers to the Humanities, Psychology, and Civics stream in intermediate (10+2) education. This stream focuses on subjects related to humanities, social sciences, and behavioral sciences, making it ideal for students interested in pursuing careers in teaching, psychology, social services, law, public administration, and related fields.",
                "Competitive Exams after Completing HPC":{
                        "Civil Services and Administrative Exams:": [
                            "UPSC Civil Services Exam: The Union Public Service Commission (UPSC) Civil Services Examination is one of the most prestigious exams in India. It leads to various administrative positions like IAS (Indian Administrative Service), IPS (Indian Police Service), and IFS (Indian Foreign Service). This exam includes subjects such as History, Geography, Political Science, and Sociology, which align well with the HPC stream.",
                            "State Civil Services Exams: These exams are conducted by respective state public service commissions for various state-level administrative roles."
                        ],
                        "Law Entrance Exams:": [
                            "CLAT (Common Law Admission Test): After completing HPC, students can pursue a career in law by appearing for the CLAT exam, which is the entrance exam for most National Law Universities (NLUs) in India.",
                            "AILET (All India Law Entrance Test): Another law entrance exam for admission to the National Law University (NLU) in Delhi.",
                            "LSAT India (Law School Admission Test): A national-level law entrance exam used for admission to various law colleges across India."
                        ],
                        "Psychology-related Exams:": [
                            "UGC NET (National Eligibility Test): If you're interested in pursuing a career in academia or research in psychology or related fields, you can appear for the UGC NET exam, which qualifies you for a lectureship in colleges and universities.",
                            "Entrance Exams for M.A. or M.Sc. in Psychology: Many universities conduct their own entrance exams for admission to postgraduate programs in psychology, including counseling psychology, clinical psychology, and industrial psychology."
                        ],
                        "Social Work and Welfare Exams:": [
                            "CSW (Certified Social Worker) Exams: For students interested in social work, various certification and diploma programs can be pursued. Social work exams like those conducted by the National Institute of Social Work help students get qualifications for positions in NGOs, government welfare agencies, and community organizations.",
                            "Entrance Exams for MSW (Master of Social Work): Several universities in India conduct their own entrance exams for admission to the MSW program, which focuses on community development, social services, and counseling."
                        ],
                        "Humanities and Social Sciences Exams:": [
                            "IISER Aptitude Test: If you are inclined toward the scientific and research side of humanities and social sciences, you could pursue an integrated M.Sc. program in fields like economics or psychology from Indian Institutes of Science Education and Research (IISER), which requires passing their entrance test.",
                            "Entrance Exams for Journalism and Mass Communication: Many students from the HPC stream go on to pursue careers in media, journalism, and communication. To enter these fields, exams like IPU CET (Indraprastha University Common Entrance Test) or JMI Entrance Exam (Jamia Millia Islamia University) can be pursued."
                        ],
                        "Teaching and Education Exams:": [
                            "CTET (Central Teacher Eligibility Test): If you’re interested in teaching at the school level, the CTET exam qualifies candidates to become teachers in government schools across India.",
                            "TET (State Teacher Eligibility Test): Similarly, each state conducts its own teacher eligibility test for recruitment to state schools."
                        ],
                        "Public Administration and Policy Exams:": [
                            "Public Administration/Policy Exams: After completing a degree in humanities or political science, many students pursue post-graduate studies in public administration or policy. Exams for admission to these programs can be offered by institutions like TISS (Tata Institute of Social Sciences), which is one of the top schools for social work, public policy, and administration."
                        ],
                        "Other Exams:": [
                            "BITSAT: For admission to Biotechnology or Engineering Physics courses at BITS Pilani.",
                            "AIIMS and JIPMER: For students pursuing Biotechnology or Life Sciences.",
                            "NATA: For Architecture courses, if students decide to venture into architecture with their background in physics and mathematics.",
                            "GATE (Graduate Aptitude Test in Engineering): For students wishing to pursue M.Tech after completing a B.Tech."
                        ]
                },
                "Career Paths after Completing HPC:": [
                    "Teaching: As a teacher of humanities, civics, or psychology in schools or colleges.",
                    "Lawyer: After completing law studies (through CLAT, AILET, or LSAT).",
                    "Psychologist/Counselor: After completing psychology degrees and certifications.",
                    "Civil Servant: After passing the UPSC exams to join services like IAS, IPS, IFS, or state administrative services.",
                    "Social Worker: In government organizations, NGOs, or international bodies.",
                    "Journalist/Media Professional: If pursuing journalism, communication, and media studies.",
                    "Public Administrator: Working in government roles or policy research.",
                    "Political Analyst: In political consultancy, policy analysis, or advocacy groups.",
                    "Human Resource (HR): After completing post-graduate degrees in human resources or related fields."
                ]
            },
            "MPC with CS":{
                "about":"The MPC with Computer Science stream is a combination of Mathematics, Physics, Chemistry, and Computer Science in intermediate education (10+2) in India. This stream is highly popular among students who are interested in pursuing careers in engineering, technology, and computer science. It lays the foundation for fields such as software engineering, data science, artificial intelligence, hardware engineering, and IT-related professions.",
                "Competitive Exams after MPC with Computer Science ":{
                    "Engineering Entrance Exams:": [
                                "JEE Main and JEE Advanced: The primary exams for admission to B.Tech courses at IITs, NITs, and other engineering colleges.",
                                "BITSAT: Entrance exam for B.Tech courses at BITS Pilani and its campuses.",
                                "VITEEE: Entrance exam for VIT University for B.Tech courses.",
                                "SRMJEEE: Entrance exam for admission to SRM University.",
                                "WBJEE: West Bengal Joint Entrance Exam for engineering colleges in West Bengal.",
                                "MHT CET: Maharashtra Common Entrance Test for engineering colleges in Maharashtra.",
                                "COMEDK: Consortium of Medical, Engineering and Dental Colleges of Karnataka exam for engineering seats in Karnataka."
                            ],
                    "Computer Science-specific Exams:": [
                                "National Institute of Electronics and Information Technology (NIELIT): Offers various computer science-related exams and certifications, including courses in programming and IT skills.",
                                "GATE (Graduate Aptitude Test in Engineering): For those who wish to pursue M.Tech or MS in Computer Science or related fields at top institutions like IITs, NITs, and other prestigious universities."
                            ],
                            "Other Technical and IT Exams:": [
                                "JAM: The Joint Admission Test for MSc is for students who wish to pursue a master's degree in Computer Science, Mathematics, or other technical fields from IITs and IISc.",
                                "IISc Entrance Exam: For admission to the Indian Institute of Science for post-graduate and research programs in computer science and related areas.",
                                "TIFR GS: The Tata Institute of Fundamental Research Graduate School entrance exam for MSc or Ph.D. programs in computer science."
                            ],
                            "Career-Oriented Exams:": [
                                "IIM Indore IPMAT: Integrated Program in Management Aptitude Test for students interested in pursuing a 5-year Integrated Management Program at IIM Indore.",
                                "NDA: National Defence Academy entrance exam for students interested in a career in the Indian Army, Navy, or Air Force (although more common in streams like Science or Humanities, MPC students can opt for it too).",
                                "NCHMCT JEE: For students interested in pursuing hotel management programs, including specialized streams related to information systems in hospitali"
                            ]
                },
                "Career Options After MPC with Computer Science ":{
                    "Engineering and Technology Careers:": [
                            "Software Engineer/Developer: Developing software applications, systems, and tools. Popular programming languages include C++, Java, Python, and others.",
                            "Data Scientist/Analyst: Analyzing large data sets to extract meaningful insights, requiring strong knowledge of mathematics and computer science.",
                            "Artificial Intelligence (AI) Engineer: Working with AI technologies, machine learning, and deep learning to create intelligent systems and solutions.",
                            "Cybersecurity Expert: Protecting computer systems and networks from cyber-attacks and ensuring the security of sensitive data.",
                            "Network Engineer: Designing and managing the computer networks of organizations, focusing on data communication and security.",
                            "Web Developer: Designing and developing websites and web applications using various programming languages and tools.",
                            "Cloud Computing Engineer: Working with cloud platforms like AWS, Google Cloud, or Microsoft Azure to design and manage scalable cloud-based solutions.",
                            "Game Developer: Using programming and computer graphics to create video games.",
                            "Blockchain Developer: Working on blockchain technologies to develop decentralized applications and cryptocurrency-related projects."
                        ],
                        "Higher Education:": [
                            "M.Tech in Computer Science: Pursuing a master's degree in specialized fields of computer science such as AI, Data Science, Software Engineering, or Cybersecurity.",
                            "MS in Computer Science: After completing a B.Tech in Computer Science, you can pursue a Master’s degree abroad at universities like MIT, Stanford, or Carnegie Mellon."
                        ],
                        "Research and Development (R&D):": [
                            "Research Scientist: Working on cutting-edge technologies in areas like AI, machine learning, and quantum computing.",
                            "Ph.D. in Computer Science: If you are interested in academic or industrial research, pursuing a Ph.D. is an option, and it can lead to roles in R&D departments or universities."
                        ],
                        "Government and Public Sector Jobs:": [
                            "IT Services in Government: Various government departments and organizations hire computer science professionals for roles like system administrators, database managers, and software developers.",
                            "DRDO, ISRO: For students interested in the defense or space research sectors, organizations like DRDO (Defense Research and Development Organization) and ISRO (Indian Space Research Organisation) offer roles in software development, system analysis, and research."
                        ],
                        "Entrepreneurship and Startups:": [
                            "Tech Startups: Students can also choose to become entrepreneurs by creating their own software or tech startup, especially in the fields of app development, AI, blockchain, or cybersecurity.",
                            "Freelance Development: Freelancing is a popular career choice for students in this field, offering flexibility and the opportunity to work with clients globally."
                        ]
                }

            },
            "PCMB":{
                "about":"PCMB stands for Physics, Chemistry, Mathematics, and Biology, which is a combination of subjects offered to students at the 10+2 (Intermediate) level. This stream is especially for students who are interested in a blend of both the Science and Biological Sciences domains, providing a diverse foundation for various career paths in fields such as engineering, medicine, biotechnology, research, and more.",
                "Further Studies After PCMB":{
                    "Medical-Related Courses:": [
                            "MBBS (Bachelor of Medicine, Bachelor of Surgery): The most popular choice for those wanting to become doctors.",
                            "BDS (Bachelor of Dental Surgery): For students interested in dentistry.",
                            "BAMS (Bachelor of Ayurvedic Medicine and Surgery): For those interested in alternative medicine.",
                            "BHMS (Bachelor of Homeopathic Medicine and Surgery): Homeopathy-focused medical course.",
                            "BVSc (Bachelor of Veterinary Science): For students wishing to become veterinarians.",
                            "BPT (Bachelor of Physiotherapy): For a career in physiotherapy.",
                            "BAMS (Bachelor of Ayurvedic Medicine and Surgery): For those interested in Ayurveda.",
                            "Nursing (B.Sc. Nursing): For students pursuing a career in nursing."
                        ],
                        "Engineering-Related Courses:": [
                            "B.Tech/B.E. (Bachelor of Technology/Engineering): In various specializations such as Mechanical Engineering, Electrical Engineering, Computer Science, Biotechnology, Biochemical Engineering, Environmental Engineering, etc.",
                            "B.Sc. in Engineering Physics: Combines physics and engineering applications.",
                            "B.Sc. in Bioinformatics/Biotechnology: For students interested in the intersection of biology, technology, and data analysis."
                        ],
                        "Interdisciplinary Science Courses:": [
                            "B.Sc. Biotechnology: Combines biology and technology, a growing field with applications in healthcare, agriculture, and environmental science.",
                            "B.Sc. Environmental Science: For students who want to work in conservation, sustainability, or environmental management.",
                            "B.Sc. Life Sciences: Focuses on the study of living organisms and can lead to careers in research, genetics, and healthcare."
                        ],
                        "Other Professional Courses:": [
                            "Pharmacy (B.Pharm): For careers in the pharmaceutical industry.",
                            "Forensic Science: For those interested in forensic analysis and crime investigations.",
                            "Food Technology: For students interested in food science and the food industry.",
                            "Agricultural Engineering: Focuses on the application of engineering in agriculture."
                        ]
                },
                "Competitive Exams for PCMB Students":{
                    "Medical Entrance Exams:": [
                            "NEET (National Eligibility cum Entrance Test): The entrance exam for MBBS, BDS, BAMS, BHMS, BVSc, and other medical courses.",
                            "AIIMS: Entrance exam for medical courses at All India Institute of Medical Sciences.",
                            "JIPMER: Entrance exam for MBBS at Jawaharlal Institute of Postgraduate Medical Education and Research."
                        ],
                    "Engineering Entrance Exams:": [
                                "JEE Main and JEE Advanced: The primary exams for admission to B.Tech courses at IITs, NITs, and other engineering colleges.",
                                "BITSAT: Entrance exam for B.Tech courses at BITS Pilani and its campuses.",
                                "VITEEE: Entrance exam for VIT University for B.Tech courses.",
                                "SRMJEEE: Entrance exam for admission to SRM University.",
                                "WBJEE: West Bengal Joint Entrance Exam for engineering colleges in West Bengal.",
                                "MHT CET: Maharashtra Common Entrance Test for engineering colleges in Maharashtra.",
                                "COMEDK: Consortium of Medical, Engineering and Dental Colleges of Karnataka exam for engineering seats in Karnataka."
                            ]
                },
                "Career Options After PCMB":{
                    "In the Medical Field:": [
                            "Doctor: Becoming a general physician, surgeon, or specialist in any branch of medicine.",
                            "Dentist: After completing BDS.",
                            "Veterinarian: After completing BVSc.",
                            "Physiotherapist: After completing BPT.",
                            "Pharmacist: After completing a degree in pharmacy.",
                            "Nursing: Working in hospitals, clinics, or other healthcare institutions."
                        ],
                        "In the Engineering and Technology Field:": [
                            "Biomedical Engineer: Combining principles of biology and engineering.",
                            "Biotechnologist: Working in healthcare, agriculture, and environmental sectors.",
                            "Software Engineer: With a background in physics and mathematics, you can work in IT and software development.",
                            "Environmental Engineer: Working on sustainable solutions, managing environmental issues like pollution and waste."
                        ],
                        "In Research and Development:": [
                            "Biotechnology Researcher: Working in labs or research organizations to develop new technologies in the field of healthcare, agriculture, or industrial processes.",
                            "Pharmaceutical Research: Working in drug discovery and development.",
                            "Environmental Scientist: Focusing on climate change, sustainability, and conservation."
                        ],
                        "Interdisciplinary Careers:": [
                            "Bioinformatics: A field combining biology, computer science, and data analysis.",
                            "Geneticist: Specializing in genetics and molecular biology.",
                            "Food Technologist: Involved in the food industry, focusing on food safety, production, and technology."
                        ]
                }
            }

    }
}


